
## Plan Result (terraform/aws/openhands)

[CI link](https://github.com/boxp/arch/actions/runs/13842305616)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_openid_connect_provider.github_actions


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_openid_connect_provider.github_actions will be created
  + resource "aws_iam_openid_connect_provider" "github_actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2977,"Program":"tfcmt","SHA1":"081d7aa3501445be5e5410fa300f8cf1ac642e1e","Target":"terraform/aws/openhands","Vars":{},"WorkflowName":"pull_request_target"} -->